
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 10 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.ccpay-vault.azurerm_key_vault.kv
  * module.ccpay-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.ccpay-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.feesregister-vault.azurerm_key_vault.kv
  * module.feesregister-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
* Delete
  * module.ccpay-vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b4dba399-85f4-4aa7-b118-1907e2ebe70e&#34;]
  * module.feesregister-vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b4dba399-85f4-4aa7-b118-1907e2ebe70e&#34;]
* Replace
  * azurerm_key_vault_secret.servicebus_primary_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.ccpay_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "ccpay_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "ccpay-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "ccpay-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_key_vault_secret.email-alert-recipient will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "email-alert-recipient" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "email-alert-recipient"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Insights/components/ccpay-aat"
        name                                  = "ccpay-aat"
      ~ tags                                  = {
          - "BuiltFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"           = "true"
          + "builtFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"              = "" -> null
            # (8 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
      - content_type            = "" -> null
      ~ id                      = "https://ccpay-aat.vault.azure.net/secrets/sb-primary-connection-string/872ead278ac64e61a6289d3f61556965" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat" -> (known after apply) # forces replacement
        name                    = "sb-primary-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/sb-primary-connection-string/versions/872ead278ac64e61a6289d3f61556965" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/sb-primary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "872ead278ac64e61a6289d3f61556965" -> (known after apply)
      ~ versionless_id          = "https://ccpay-aat.vault.azure.net/secrets/sb-primary-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat"
        name     = "ccpay-aat"
      ~ tags     = {
          - "BuiltFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"           = "true"
          + "builtFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"              = "" -> null
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ccpay-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
        name                            = "ccpay-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ccpay-vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b4dba399-85f4-4aa7-b118-1907e2ebe70e"] will be destroyed
  # (because key ["b4dba399-85f4-4aa7-b118-1907e2ebe70e"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/objectId/b4dba399-85f4-4aa7-b118-1907e2ebe70e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat" -> null
      - object_id               = "b4dba399-85f4-4aa7-b118-1907e2ebe70e" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.ccpay-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat|ccpay-aat"
        name                       = "ccpay-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ccpay-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ccpay-aat-mi"
        name                = "ccpay-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.feepay-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay_alert"
        name                     = "feepay_alert"
      ~ parameters_content       = (sensitive value) -> (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (5 unchanged attributes hidden)
    }

  # module.feepay-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.Resources/deployments/feepay-fail-alert"
        name                = "feepay-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY2NwYXlmci1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJmZWVzLWFuZC1wYXltZW50cyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY2MtcGF5bWVudHMiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGZWVzL1BheSJ9" -> "eyJhcHBsaWNhdGlvbiI6ImZlZXMtYW5kLXBheW1lbnRzIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9jY3BheWZyLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NjLXBheW1lbnRzIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRmVlcy9QYXkifQ=="
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.feesregister-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat"
        name                            = "fees-register-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.feesregister-vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b4dba399-85f4-4aa7-b118-1907e2ebe70e"] will be destroyed
  # (because key ["b4dba399-85f4-4aa7-b118-1907e2ebe70e"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat/objectId/b4dba399-85f4-4aa7-b118-1907e2ebe70e" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat" -> null
      - object_id               = "b4dba399-85f4-4aa7-b118-1907e2ebe70e" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.feesregister-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat|fees-register-aat"
        name                       = "fees-register-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.ServiceBus/namespaces/ccpay-servicebus-aat"
        name                                = "ccpay-servicebus-aat"
      ~ tags                                = {
          - "BuiltFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git" -> null
          + "autoShutdown"           = "true"
          + "builtFrom"              = "https://github.com/HMCTS/ccpayfr-shared-infrastructure.git"
          - "changeUrl"              = "" -> null
            # (8 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 10 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":89,"Program":"tfcmt","SHA1":"","Vars":{}} -->